In [2]:
import pandas as pd

## Multi_index

In [4]:
df=pd.read_excel('Pandas课件1(基础)\D003_MultiIndex_1_read_write\MultiIndex.xlsx')

In [5]:
df

        年  月  销量
0  2019.0  1  10
1     NaN  2  20
2     NaN  3  30
3  2020.0  1  40
4     NaN  2  50
5     NaN  3  60

In [6]:
df=pd.read_excel('Pandas课件1(基础)\D003_MultiIndex_1_read_write\MultiIndex.xlsx',index_col=[0,1])

In [7]:
df

        销量
年    月
2019 1  10
     2  20
     3  30
2020 1  40
     2  50
     3  60

In [8]:
df.index

MultiIndex([(2019, 1),
            (2019, 2),
            (2019, 3),
            (2020, 1),
            (2020, 2),
            (2020, 3)],
           names=['年', '月'])

In [9]:
df.columns

Index(['销量'], dtype='object')

In [10]:
df.columns.name='Performance'

In [11]:
df

zhibiao  销量
年    月
2019 1   10
     2   20
     3   30
2020 1   40
     2   50
     3   60

## Multi_columns

In [15]:
df2=pd.read_excel('Pandas课件1(基础)\D003_MultiIndex_1_read_write\MultiIndex.xlsx',sheet_name=1,header=[0,1],index_col=[0])

In [16]:
df2

     京东       淘宝
货号   销量   售价  销量   售价
aaa  10  100  40  110
bbb  20  200  50  220
ccc  30  300  60  330

In [17]:
df2.index

Index(['aaa', 'bbb', 'ccc'], dtype='object')

In [19]:
df2.columns

MultiIndex([('京东', '销量'),
            ('京东', '售价'),
            ('淘宝', '销量'),
            ('淘宝', '售价')],
           names=[None, '货号'])

In [22]:
df2.index.name='HuoHao'
df2.columns.names=[None,None]
df2

        京东       淘宝
        销量   售价  销量   售价
HuoHao
aaa     10  100  40  110
bbb     20  200  50  220
ccc     30  300  60  330

In [26]:
df3=pd.read_excel('Pandas课件1(基础)\D003_MultiIndex_1_read_write\MultiIndex.xlsx',
                  sheet_name=2,header=[0,1],index_col=[0,1])

In [27]:
df3

        京东       淘宝
        销量   售价  销量   售价
货号  月份
aaa 1   10  100  40  110
    2   20  200  50  220
bbb 1   30  300  60  330
    2   40  400  70  440

In [28]:
df3.index

MultiIndex([('aaa', 1),
            ('aaa', 2),
            ('bbb', 1),
            ('bbb', 2)],
           names=['货号', '月份'])

In [29]:
df3.columns

MultiIndex([('京东', '销量'),
            ('京东', '售价'),
            ('淘宝', '销量'),
            ('淘宝', '售价')],
           )

In [30]:
df3.columns.names=['Company','Performance']

In [31]:
df3

Company      京东       淘宝
Performance  销量   售价  销量   售价
货号  月份
aaa 1        10  100  40  110
    2        20  200  50  220
bbb 1        30  300  60  330
    2        40  400  70  440

## Create array with multi_index

In [32]:
import numpy as np

In [33]:
data=np.arange(8).reshape(2,4)

In [35]:
df=pd.DataFrame(data,columns=[['JD','JD','TB','TB'],["Sales",'Price','Sales','Price']])

In [36]:
df

     JD          TB
  Sales Price Sales Price
0     0     1     2     3
1     4     5     6     7

In [44]:
cols=pd.MultiIndex.from_product([['JD','TB'],['Sales','Price']])
cols=pd.MultiIndex.from_arrays([['JD','JD','TB','TB'],["Sales",'Price','Sales','Price']])
cols=pd.MultiIndex.from_tuples([('JD','Sales'),('JD','Price'),('TB','Sales'),('TB','Price')])

In [40]:
df=pd.DataFrame(data,columns=cols)

In [41]:
df

     JD          TB
  Sales Price Sales Price
0     0     1     2     3
1     4     5     6     7

In [49]:
from datetime import datetime

In [52]:
def gen_list(items,size=100):
    return pd.Series(items).sample(n=size,replace=True).tolist()

In [54]:
df=pd.DataFrame(
{"Num":gen_list(["a","b","c"]),
 "Size":gen_list(["S","M"]),
 "Date":gen_list([
     datetime(2020,1,1),
     datetime(2020,1,3),
     datetime(2020,1,5),]),
 "Retailer":gen_list(["TB","JD"]),
 "Sales":gen_list([2,5,8])})

In [55]:
df

   Num Size       Date Retailer  Sales
0    b    S 2020-01-05       TB      5
1    a    S 2020-01-01       JD      5
2    c    M 2020-01-01       TB      2
3    a    S 2020-01-01       TB      5
4    c    S 2020-01-03       JD      2
..  ..  ...        ...      ...    ...
95   c    S 2020-01-03       JD      8
96   c    S 2020-01-01       JD      2
97   b    M 2020-01-03       TB      5
98   b    S 2020-01-05       JD      8
99   a    S 2020-01-01       JD      2

[100 rows x 5 columns]

In [61]:
df1=df.set_index(["Retailer","Num"])

In [63]:
df1

             Size       Date  Sales
Retailer Num
TB       b      S 2020-01-05      5
JD       a      S 2020-01-01      5
TB       c      M 2020-01-01      2
         a      S 2020-01-01      5
JD       c      S 2020-01-03      2
...           ...        ...    ...
         c      S 2020-01-03      8
         c      S 2020-01-01      2
TB       b      M 2020-01-03      5
JD       b      S 2020-01-05      8
         a      S 2020-01-01      2

[100 rows x 3 columns]

In [64]:
df2=df.groupby(["Retailer","Num"]).sum()

In [65]:
df2

              Sales
Retailer Num
JD       a       72
         b       97
         c       61
TB       a       94
         b       79
         c       49

In [69]:
df3=pd.pivot_table(df,
                   index=["Retailer","Num"],
                   columns=['Size','Date'],
                   values='Sales',
                  aggfunc=sum)

In [70]:
df3

Size                  M                                S
Date         2020-01-01 2020-01-03 2020-01-05 2020-01-01 2020-01-03 2020-01-05
Retailer Num
JD       a          8.0       13.0        7.0       16.0       18.0       10.0
         b         16.0       12.0       22.0       20.0       15.0       12.0
         c          4.0       17.0        7.0       10.0       18.0        5.0
TB       a         17.0        NaN       17.0       25.0        5.0       30.0
         b          7.0       34.0        4.0       10.0       10.0       14.0
         c         28.0        2.0        NaN        7.0       12.0        NaN

## Selecting

In [80]:
df4=pd.pivot_table(df,
                   index=["Num"],
                   columns=["Retailer",'Size'],
                   values='Sales',
                  aggfunc=sum)

In [81]:
df4

Retailer  JD      TB
Size       M   S   M   S
Num
a         28  44  34  60
b         50  47  45  34
c         28  33  30  19

In [82]:
df4.index

Index(['a', 'b', 'c'], dtype='object', name='Num')

In [83]:
df4.columns

MultiIndex([('JD', 'M'),
            ('JD', 'S'),
            ('TB', 'M'),
            ('TB', 'S')],
           names=['Retailer', 'Size'])

In [85]:
df4[("JD","M")]

Num
a    28
b    50
c    28
Name: (JD, M), dtype: int64

In [86]:
df4[[("JD","M"),("JD","S")]]

Retailer  JD
Size       M   S
Num
a         28  44
b         50  47
c         28  33

In [88]:
df4[df4[("JD","M")]>10]

Retailer  JD      TB
Size       M   S   M   S
Num
a         28  44  34  60
b         50  47  45  34
c         28  33  30  19

In [89]:
df4["JD"]

Size   M   S
Num
a     28  44
b     50  47
c     28  33

In [ ]:
df4.swaplevel()